In [2]:
# series

# imports
import numpy as np
import pandas as pd

# Creating labels and data
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]


# Creating Series
def create_series(data, index=None):
    return pd.Series(data, index=index)


# Printing Series
print(create_series(my_data))
print(create_series(my_data, labels))

# Series with countries
ser = create_series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
print(ser)

# Accessing Series by key
print(ser['USA'])

# Creating DataFrame demo
df = pd.DataFrame({
    'Country': ['USA', 'Germany', 'Italy', 'Japan'],
    'Values': [1, 2, 5, 4]
})
print(df)
df

0    10
1    20
2    30
dtype: int64
a    10
b    20
c    30
dtype: int64
USA        1
Germany    2
USSR       3
Japan      4
dtype: int64
1
   Country  Values
0      USA       1
1  Germany       2
2    Italy       5
3    Japan       4

   Country  Values
0      USA       1
1  Germany       2
2    Italy       5
3    Japan       4

## Dataframes - Part 1

In [16]:
from numpy.random import randn

np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
print(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
w_column = df['W']
print(w_column)
print(type(w_column))

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64
<class 'pandas.core.series.Series'>

In [21]:
df['AA'] = df['W'] + df['Y']

In [23]:
df.drop('new', axis=1, inplace=True)

In [24]:
df

          W         X         Y         Z        AA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

If we use `inplace` on `df.drop` we are changing the original dataframe. If we don't use `inplace` we are not changing the original dataframe. We are just returning a new dataframe.

```python
df.drop('column_name', axis=1, inplace=True)
```

In [25]:
df.drop('E', axis=0)

          W         X         Y         Z        AA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [27]:
df.shape

(5, 5)

In [28]:
df[['Z', 'X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [29]:
df.loc['A']

W     2.706850
X     0.628133
Y     0.907969
Z     0.503826
AA    3.614819
Name: A, dtype: float64

In [30]:
df.iloc[2]

W    -2.018168
X     0.740122
Y     0.528813
Z    -0.589001
AA   -1.489355
Name: C, dtype: float64

In [31]:
df.loc['B', 'Y']

-0.8480769834036315

In [32]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Dataframes - Part 2

In [33]:
df

          W         X         Y         Z        AA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.drop('AA', axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [36]:
bool_df = df > 0
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [38]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
result_df = df[df['Z'] < 0]

In [41]:
result_df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [42]:
result_df['X']

C    0.740122
Name: X, dtype: float64

In [43]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [44]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [45]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
new_ind = 'CA NY WY OR CO'.split()
df['States'] = new_ind

In [49]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [50]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [51]:
df.reset_index(inplace=True)

In [52]:
df

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  0.190794  1.978757  2.605967  0.683509     CO

## Dataframes - Part 3

In [53]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [54]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [55]:
inside

[1, 2, 3, 1, 2, 3]

In [56]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [57]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [58]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [59]:
df.loc['G2'].loc[1]

A    0.166905
B    0.184502
Name: 1, dtype: float64

In [60]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [61]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [62]:
df.loc['G2'].loc[1]['A']

0.16690463609281317

In [63]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [64]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

```python
df.dropna()
df.dropna(axis=1)
df.dropna(thresh=2)
df.dropna(subset=['column_name'])
df.fillna(value='FILL VALUE')
df['column_name'].fillna(value=df['column_name'].mean())
```

In [65]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [71]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [73]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [74]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [76]:
df.fillna(value='6.0')
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

```python
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
byComp = df.groupby('Company')
byComp.mean()
byComp.sum()
byComp.std()
byComp.sum().loc['FB']
df.groupby('Company').sum().loc['FB']
df.groupby('Company').count()
df.groupby('Company').max()
df.groupby('Company').describe()
df.groupby('Company').describe().transpose()
```

In [85]:
import pandas as pd
import numpy as np

# Sample data
data = {
    'NBA Player': [
        'Lebron James', 'Stephen Curry', 'Kevin Durant', 'Kawhi Leonard',
        'James Harden'
    ],
    'Team': [
        'Los Angeles Lakers', 'Golden State Warriors', 'Phoenix Suns',
        'Los Angeles Clippers', 'Los Angeles Clippers'
    ],
    'Points': [25, 30, 20, 35, 28]
}

df = pd.DataFrame(data)

# Print data types of each column
print(df.dtypes)

# Select only numeric columns
numeric_df = df.select_dtypes(include=[np.number])

# Perform groupby operation and calculate mean
result = numeric_df.groupby(df['Team']).mean()

print(result)

NBA Player    object
Team          object
Points         int64
dtype: object
                       Points
Team
Golden State Warriors    30.0
Los Angeles Clippers     31.5
Los Angeles Lakers       25.0
Phoenix Suns             20.0

In [86]:
print(df.dtypes)

NBA Player    object
Team          object
Points         int64
dtype: object

In [87]:
numeric_df = df.select_dtypes(include=[np.number])
result = numeric_df.groupby(df['Team']).mean()

In [88]:
numeric_df

   Points
0      25
1      30
2      20
3      35
4      28

In [89]:
result

                       Points
Team
Golden State Warriors    30.0
Los Angeles Clippers     31.5
Los Angeles Lakers       25.0
Phoenix Suns             20.0

## Merging, Joining and Concatenating

```python
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
pd.concat([df1,df2,df3])
pd.concat([df1,df2,df3],axis=1)
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
                     'C': ['C0', 'C1', 'C2', 'C3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'D': ['D0', 'D1', 'D2', 'D3'],
                          'E': ['E0', 'E1', 'E2', 'E3']})
pd.merge(left,right,how='inner',on='key')
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
left.join(right)
left.join(right, how='outer')
```

In [93]:
import pandas as pd

# Define DataFrames
df1 = pd.DataFrame(
    {
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3'],
        'C': ['C0', 'C1', 'C2', 'C3'],
        'D': ['D0', 'D1', 'D2', 'D3']
    },
    index=[0, 1, 2, 3])

df2 = pd.DataFrame(
    {
        'A': ['A4', 'A5', 'A6', 'A7'],
        'B': ['B4', 'B5', 'B6', 'B7'],
        'C': ['C4', 'C5', 'C6', 'C7'],
        'D': ['D4', 'D5', 'D6', 'D7']
    },
    index=[4, 5, 6, 7])

df3 = pd.DataFrame(
    {
        'A': ['A8', 'A9', 'A10', 'A11'],
        'B': ['B8', 'B9', 'B10', 'B11'],
        'C': ['C8', 'C9', 'C10', 'C11'],
        'D': ['D8', 'D9', 'D10', 'D11']
    },
    index=[8, 9, 10, 11])

# Concatenate DataFrames
pd.concat([df1, df2, df3])
pd.concat([df1, df2, df3], axis=1)

# Define left and right DataFrames for merging
left = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3']
})

right = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'D': ['D0', 'D1', 'D2', 'D3'],
    'E': ['E0', 'E1', 'E2', 'E3']
})

# Merge DataFrames
pd.merge(left, right, how='inner', on='key')

# Define left and right DataFrames for joining
left = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
},
                    index=['K0', 'K1', 'K2'])

right = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
},
                     index=['K0', 'K2', 'K3'])

# Join DataFrames
left.join(right)
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Data Input and Output

In [94]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [96]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15